spec/cassettes/stripe_market_transfer_paid_event/creates_a_payment_and_emails_the_market_s_managers.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_15xcvAHouQbaP1MV0Qwrf4VG
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.21.0
      Authorization:
      - Bearer sk_test_XTLCfIQMwKblsxIF1N4i7y1G
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.21.0","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-darwin14.0","engine":"ruby","publisher":"stripe","uname":"Darwin
        freddie.local 14.3.0 Darwin Kernel Version 14.3.0: Mon Mar 23 11:59:05 PDT
        2015; root:xnu-2782.20.48~5/RELEASE_X86_64 x86_64","hostname":"freddie.local"}'
      Stripe-Account:
      - acct_15xJY9HouQbaP1MV
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 15 May 2015 14:29:46 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1095'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_HEI1UjY5krcHbKx7
      Stripe-Account:
      - acct_15xJY9HouQbaP1MV
      Stripe-Version:
      - '2015-04-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "evt_15xcvAHouQbaP1MV0Qwrf4VG",
          "created": 1430482028,
          "livemode": false,
          "type": "transfer.created",
          "data": {
            "object": {
              "id": "tr_15xcv9HouQbaP1MVXim58UCZ",
              "object": "transfer",
              "created": 1430482027,
              "date": 1430524800,
              "livemode": false,
              "amount": 33210,
              "currency": "usd",
              "reversed": false,
              "status": "pending",
              "type": "bank_account",
              "reversals": {
                "object": "list",
                "total_count": 0,
                "has_more": false,
                "url": "/v1/transfers/tr_15xcv9HouQbaP1MVXim58UCZ/reversals",
                "data": []
              },
              "balance_transaction": "txn_15xcv9HouQbaP1MVh0dMRAi8",
              "destination": null,
              "description": "STRIPE TRANSFER",
              "failure_message": null,
              "failure_code": null,
              "amount_reversed": 0,
              "metadata": {},
              "statement_descriptor": null,
              "recipient": null,
              "source_transaction": null,
              "application_fee": null
            }
          },
          "object": "event",
          "pending_webhooks": 1,
          "request": null,
          "api_version": "2015-04-07"
        }
    http_version: 
  recorded_at: Fri, 15 May 2015 14:29:47 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_15xcvAHouQbaP1MV0Qwrf4VG
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.21.0
      Authorization:
      - Bearer sk_test_XTLCfIQMwKblsxIF1N4i7y1G
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.21.0","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-darwin14.0","engine":"ruby","publisher":"stripe","uname":"Darwin
        freddie.local 14.3.0 Darwin Kernel Version 14.3.0: Mon Mar 23 11:59:05 PDT
        2015; root:xnu-2782.20.48~5/RELEASE_X86_64 x86_64","hostname":"freddie.local"}'
      Stripe-Account:
      - acct_15xJY9HouQbaP1MV
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 15 May 2015 14:37:35 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1095'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_HwKJ2X7YdlrQUOhx
      Stripe-Account:
      - acct_15xJY9HouQbaP1MV
      Stripe-Version:
      - '2015-04-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "evt_15xcvAHouQbaP1MV0Qwrf4VG",
          "created": 1430482028,
          "livemode": false,
          "type": "transfer.created",
          "data": {
            "object": {
              "id": "tr_15xcv9HouQbaP1MVXim58UCZ",
              "object": "transfer",
              "created": 1430482027,
              "date": 1430524800,
              "livemode": false,
              "amount": 33210,
              "currency": "usd",
              "reversed": false,
              "status": "pending",
              "type": "bank_account",
              "reversals": {
                "object": "list",
                "total_count": 0,
                "has_more": false,
                "url": "/v1/transfers/tr_15xcv9HouQbaP1MVXim58UCZ/reversals",
                "data": []
              },
              "balance_transaction": "txn_15xcv9HouQbaP1MVh0dMRAi8",
              "destination": null,
              "description": "STRIPE TRANSFER",
              "failure_message": null,
              "failure_code": null,
              "amount_reversed": 0,
              "metadata": {},
              "statement_descriptor": null,
              "recipient": null,
              "source_transaction": null,
              "application_fee": null
            }
          },
          "object": "event",
          "pending_webhooks": 1,
          "request": null,
          "api_version": "2015-04-07"
        }
    http_version: 
  recorded_at: Fri, 15 May 2015 14:37:35 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_15xcvAHouQbaP1MV0Qwrf4VG
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.21.0
      Authorization:
      - Bearer sk_test_XTLCfIQMwKblsxIF1N4i7y1G
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.21.0","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-darwin14.0","engine":"ruby","publisher":"stripe","uname":"Darwin
        freddie.local 14.3.0 Darwin Kernel Version 14.3.0: Mon Mar 23 11:59:05 PDT
        2015; root:xnu-2782.20.48~5/RELEASE_X86_64 x86_64","hostname":"freddie.local"}'
      Stripe-Account:
      - acct_15xJY9HouQbaP1MV
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 15 May 2015 15:46:25 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1095'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_5eUNN0Vu1F72vgSA
      Stripe-Account:
      - acct_15xJY9HouQbaP1MV
      Stripe-Version:
      - '2015-04-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "evt_15xcvAHouQbaP1MV0Qwrf4VG",
          "created": 1430482028,
          "livemode": false,
          "type": "transfer.created",
          "data": {
            "object": {
              "id": "tr_15xcv9HouQbaP1MVXim58UCZ",
              "object": "transfer",
              "created": 1430482027,
              "date": 1430524800,
              "livemode": false,
              "amount": 33210,
              "currency": "usd",
              "reversed": false,
              "status": "pending",
              "type": "bank_account",
              "reversals": {
                "object": "list",
                "total_count": 0,
                "has_more": false,
                "url": "/v1/transfers/tr_15xcv9HouQbaP1MVXim58UCZ/reversals",
                "data": []
              },
              "balance_transaction": "txn_15xcv9HouQbaP1MVh0dMRAi8",
              "destination": null,
              "description": "STRIPE TRANSFER",
              "failure_message": null,
              "failure_code": null,
              "amount_reversed": 0,
              "metadata": {},
              "statement_descriptor": null,
              "recipient": null,
              "source_transaction": null,
              "application_fee": null
            }
          },
          "object": "event",
          "pending_webhooks": 1,
          "request": null,
          "api_version": "2015-04-07"
        }
    http_version: 
  recorded_at: Fri, 15 May 2015 15:46:25 GMT
recorded_with: VCR 2.9.3
